src/InformationRegisters/СообщенияКонтурСтрахование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СообщенияКонтурСтрахование</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>documentDate</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>documentNumber</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>documentType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>checkingStatus</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>contentType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryTime</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>description</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>documentCirculationCompletionTimestamp</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>documentCirculationId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>documentCirculationStartTimestamp</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>lastEventPointer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>messageId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>reasons</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>recipientMediId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>senderMediId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>totalWorkTime</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СообщениеКС</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСписка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>mediId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>eventId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>eventPointer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>eventDateTime</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>eventType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыВнешнихСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Calltouch</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Chat2Desk</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CoMagic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GreenApi</Name>
					<Comment>WhatsApp</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JivoSite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Marquiz</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Roistat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TapLink</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Tilda</Name>
					<Comment>Ловец лидов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Viber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Vkontakte</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VkontakteApi</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Webhook</Name>
					<Comment>Получение лидов стандартный набор параметров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВиджетОнлайнЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИЭМК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтурСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложениеУправляющего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкиИОтзывы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроДокторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМетрика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПолФизическогоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПолФизическогоЛица</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизацияПоКодуБезСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Comment>Внешняя система используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрованияОбратногоЗвонка</Name>
					<Comment>Используется для обратного звонка в CRM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Comment>Используется для отправки Push уведомлений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеВЛичномКабинете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/СообщенияКонтурСтрахование/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВнешняяСистемаКС = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(,Перечисления.ТипыВнешнихСистем.КонтурСтрахование, Истина);
	token = ВнешняяСистемаКС.ТокенДоступа;
	
	ПараметрыВС = ВнешняяСистемаКС.Параметры.Получить();
	
	Если ПараметрыВС.Демо Тогда
		АдресСервера = "medi-api.testkontur.ru";	
	Иначе
		АдресСервера = "medi-api.kontur.ru";	
	КонецЕсли;
	
	Сообщение = GetMessage(Запись.messageId);
	
	Если ТипЗнч(Сообщение) = Тип("Соответствие") Тогда
		
		ДвоичныеДанные = Base64Значение(Сообщение.Получить("data").Получить("content"));
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьФайл(ИмяВременногоФайла);
		
		ПостроительDOM = Новый ПостроительDOM;
		ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
		
		Для Каждого Глубина1 Из ДокументDOM.ЭлементДокумента.ДочерниеУзлы Цикл
			
			Если Глубина1.ИмяУзла = "interchangeHeader" Тогда
				Для Каждого Глубина2 Из Глубина1.ДочерниеУзлы Цикл
					Если Глубина2.ИмяУзла = "sender" Тогда
						Отправитель = Глубина2.ТекстовоеСодержимое;
					ИначеЕсли Глубина2.ИмяУзла = "recipient" Тогда
						Получатель = Глубина2.ТекстовоеСодержимое;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если Глубина1.ИмяУзла = "insurantsList" Тогда
				
				Для Каждого Глубина2 Из Глубина1.Атрибуты Цикл
					Если Глубина2.ИмяУзла = "insurantsListNumber" Тогда     
						НомерСписка = Глубина2.ЗначениеУзла;
					ИначеЕсли Глубина2.ИмяУзла = "insurantsListDate" Тогда 
						Если СтрНайти(Глубина2.ЗначениеУзла, "-") > 0 Тогда
							ДатаСписка = Дата(СтрЗаменить(Глубина2.ЗначениеУзла, "-", ""));
						Иначе
							ДатаСписка = Дата('00010101');
							ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВДату(ДатаСписка, Глубина2.ЗначениеУзла);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;   
				
				Для Каждого Глубина2 Из Глубина1.ДочерниеУзлы Цикл
					
					Если Глубина2.ИмяУзла = "contractIdentificator" Тогда
						Для Каждого Глубина3 Из Глубина2.Атрибуты Цикл
							Если Глубина3.ИмяУзла = "number" Тогда     
								НомерДоговора = Глубина3.ЗначениеУзла;
							ИначеЕсли Глубина3.ИмяУзла = "date" Тогда 
								Если СтрНайти(Глубина3.ЗначениеУзла, "-") > 0 Тогда
									ДатаДоговора = Дата(СтрЗаменить(Глубина3.ЗначениеУзла, "-", ""));
								Иначе
									ДатаДоговора = Дата('00010101');
									ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВДату(ДатаДоговора, Глубина3.ЗначениеУзла);
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					
					Если Глубина2.ИмяУзла = "insuranceCompany" Тогда     
						Для Каждого Глубина3 Из Глубина2.ДочерниеУзлы Цикл
							Если Глубина3.ИмяУзла = "mediId" Тогда	
								mediId = Глубина3.ТекстовоеСодержимое;                 
							ИначеЕсли Глубина3.ИмяУзла = "organization" Тогда
								Для Каждого Глубина4 Из Глубина3.ДочерниеУзлы Цикл
									Если Глубина4.ИмяУзла = "name" Тогда     
										НаименованиеСК = Глубина4.ТекстовоеСодержимое;
									ИначеЕсли Глубина4.ИмяУзла = "inn" Тогда 
										ИНН = Глубина4.ТекстовоеСодержимое;
									ИначеЕсли Глубина4.ИмяУзла = "kpp" Тогда 
										КПП = Глубина4.ТекстовоеСодержимое;
									КонецЕсли;	
								КонецЦикла;
							КонецЕсли;
						КонецЦикла;
					ИначеЕсли Глубина2.ИмяУзла = "healthCareProvider" Тогда 
						Для Каждого Глубина3 Из Глубина2.ДочерниеУзлы Цикл
							Если Глубина3.ИмяУзла = "mediId" Тогда	
								mediIdОрганизации = Глубина3.ТекстовоеСодержимое;                 
							ИначеЕсли Глубина3.ИмяУзла = "organization" Тогда
								Для Каждого Глубина4 Из Глубина3.ДочерниеУзлы Цикл
									Если Глубина4.ИмяУзла = "name" Тогда     
										НаименованиеОрганизации = Глубина4.ТекстовоеСодержимое;
									ИначеЕсли Глубина4.ИмяУзла = "inn" Тогда 
										ИННОрганизации = Глубина4.ТекстовоеСодержимое;
									ИначеЕсли Глубина4.ИмяУзла = "kpp" Тогда 
										КППОрганизации = Глубина4.ТекстовоеСодержимое;
									КонецЕсли;	
								КонецЦикла;
							КонецЕсли;
						КонецЦикла;
					ИначеЕсли Глубина2.ИмяУзла = "listOfInsurants" Тогда
						Элементы.ГруппаВходящее.Видимость = Истина;
						Для Каждого Глубина3 Из Глубина2.ДочерниеУзлы Цикл	
							Если Глубина3.ИмяУзла = "insurant" Тогда 
								НоваяСтрока = ТаблицаЗастрахованных.Добавить();
								Для Каждого Глубина4 Из Глубина3.ДочерниеУзлы Цикл
									Если Глубина4.ИмяУзла = "fullName" Тогда
										Для Каждого Глубина5 Из Глубина4.ДочерниеУзлы Цикл
											Если Глубина5.ИмяУзла = "lastName" Тогда
												НоваяСтрока.Фамилия = ТРег(Глубина5.ТекстовоеСодержимое);	
											ИначеЕсли Глубина5.ИмяУзла = "firstName" Тогда
												НоваяСтрока.Имя = ТРег(Глубина5.ТекстовоеСодержимое);		
											ИначеЕсли Глубина5.ИмяУзла = "middleName" Тогда
												НоваяСтрока.Отчество = ТРег(Глубина5.ТекстовоеСодержимое);	
											КонецЕсли;
										КонецЦикла;
									ИначеЕсли Глубина4.ИмяУзла = "dateOfBirth" Тогда
										НоваяСтрока.ДатаРождения = Дата(СтрЗаменить(Глубина4.ТекстовоеСодержимое, "-", ""));				
									ИначеЕсли Глубина4.ИмяУзла = "gender" Тогда     
										Если Глубина4.ТекстовоеСодержимое = "Female" Тогда
											НоваяСтрока.Пол = Перечисления.ПолФизическогоЛица.Женский;	
										ИначеЕсли Глубина4.ТекстовоеСодержимое = "Male" Тогда
											НоваяСтрока.Пол = Перечисления.ПолФизическогоЛица.Мужской;	
										КонецЕсли;
									ИначеЕсли Глубина4.ИмяУзла = "insurancePolicy" Тогда
										Для Каждого Глубина5 Из Глубина4.ДочерниеУзлы Цикл
											Если Глубина5.ИмяУзла = "number" Тогда
												НоваяСтрока.НомерПолиса = Глубина5.ТекстовоеСодержимое;	
											ИначеЕсли Глубина5.ИмяУзла = "fromDate" Тогда
												НоваяСтрока.ДействуетС = Дата(СтрЗаменить(Глубина5.ТекстовоеСодержимое, "-", ""));
											ИначеЕсли Глубина5.ИмяУзла = "toDate" Тогда
												НоваяСтрока.ДействуетПО = Дата(СтрЗаменить(Глубина5.ТекстовоеСодержимое, "-", ""));
											КонецЕсли;	
										КонецЦикла;
									ИначеЕсли Глубина4.ИмяУзла = "employer" Тогда
										НоваяСтрока.Страхователь = Глубина4.ТекстовоеСодержимое;	
									ИначеЕсли Глубина4.ИмяУзла = "insuranceProgram" Тогда
										НоваяСтрока.ПрограммаПрикрепления = Глубина4.ТекстовоеСодержимое;	
									КонецЕсли;
								КонецЦикла;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;   
			КонецЕсли;
			
			Если Глубина1.ИмяУзла = "healthCareClaim" Тогда 
				Элементы.ГруппаИсходящие.Видимость = Истина;
				Для Каждого Глубина2 Из Глубина1.Атрибуты Цикл
					Если Глубина2.ИмяУзла = "healthCareClaimNumber" Тогда
						АктОказанияУслуг = Документы.АктОказанияУслуг.НайтиПоНомеру(Глубина2.ЗначениеУзла);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Функция - Get message
//
// Параметры:
//  messageId	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция GetMessage(messageId)
	
	Запрос = Новый HTTPЗапрос("/V2/messages/{messageId}");
	Запрос.Заголовки.Вставить("Authorization", "Bearer "+ token);
	
	URL_УстановитьПараметр(Запрос.АдресРесурса, "messageId", messageId);
	
	Ответ = Клиент_get(Запрос, АдресСервера);
	
	Если Ответ.КодСостояния = 404 Тогда
		ВызватьИсключение "Сообщение не найдено: " + Ответ.ПолучитьТелоКакСтроку();
	ИначеЕсли Ответ.КодСостояния = 401 Тогда
		ВызватьИсключение "Запрос не авторизован: " + Ответ.ПолучитьТелоКакСтроку();
	ИначеЕсли Ответ.КодСостояния = 400 Тогда
		ВызватьИсключение "Некорректный формат идентификатора сообщения: " + Ответ.ПолучитьТелоКакСтроку();
	ИначеЕсли Ответ.КодСостояния >= 300 Тогда
		ВызватьИсключение "Не удалось выполнить запрос: " + Ответ.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	Возврат JSON_Прочитать(Ответ.ПолучитьТелоКакСтроку());
	
КонецФункции

&НаСервереБезКонтекста 
// Процедура - URL установить параметр
//
// Параметры:
//  АдресРесурса - 	 - 
//  Ключ		 - 	 - 
//  Значение	 - 	 - 
//
Процедура URL_УстановитьПараметр(АдресРесурса, Ключ, Значение)
	
	Если СтрНайти(АдресРесурса, СтрШаблон("{%1}", Ключ)) <> 0 Тогда
		URL_УстановитьПараметрПуть(АдресРесурса, Ключ, Значение);
	Иначе
		URL_УстановитьПараметрЗапрос(АдресРесурса, Ключ, Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - URL установить параметр путь
//
// Параметры:
//  АдресРесурса - 	 - 
//  Ключ		 - 	 - 
//  Значение	 - 	 - 
//
Процедура URL_УстановитьПараметрПуть(АдресРесурса, Ключ, Значение) 
	
	ЧастиАдреса = СтрРазделить(АдресРесурса, "?", Истина);
	Если ЧастиАдреса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЧастиАдреса[0] = СтрЗаменить(
	ЧастиАдреса[0], 
	СтрШаблон("{%1}", Ключ), 
	URL_Кодировать(Значение));
	
	АдресРесурса = СтрСоединить(ЧастиАдреса, "?");
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - URL установить параметр запрос
//
// Параметры:
//  АдресРесурса - 	 - 
//  Ключ		 - 	 - 
//  Значение	 - 	 - 
//
Процедура URL_УстановитьПараметрЗапрос(АдресРесурса, Ключ, Значение)
	
	ЧастиАдреса = СтрРазделить(АдресРесурса, "?", Истина);
	
	Если ЧастиАдреса.Количество() = 0 Тогда
		Возврат;
	ИначЕесли ЧастиАдреса.Количество() = 1 Тогда
		ЧастиАдреса.Добавить();
	ИначеЕсли ЧастиАдреса.Количество() > 2 Тогда
		ВызватьИсключение "Не предполагаемый формат URL";
	КонецЕсли;
	
	ПараметрыАдреса	= СтрРазделить(ЧастиАдреса[1], "&", Ложь);
	ПараметрыИндекс = Неопределено;
	
	Сч = -1;
	
	Для Каждого Элемент Из ПараметрыАдреса Цикл
		
		Сч = Сч + 1;
		
		Параметр = СтрРазделить(Элемент, "=", Истина);
		Если Параметр.Количество() <> 2 Тогда
			Продолжить;	
		КонецЕсли;
		
		Если Параметр[0] = Ключ Тогда
			ПараметрыИндекс = Сч;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;		
	
	Параметр = СтрШаблон("%1=%2", Ключ, XMLСтрока(Значение));
	
	Если ПараметрыИндекс = Неопределено Тогда
		ПараметрыАдреса.Добавить(Параметр);
	Иначе
		ПараметрыАдреса[ПараметрыИндекс] = Параметр;
	КонецЕсли;
	
	ЧастиАдреса[1] 		 = СтрСоединить(ПараметрыАдреса, "&");
	АдресРесурса = СтрСоединить(ЧастиАдреса, "?");
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - JSON прочитать
//
// Параметры:
//  Значение - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция JSON_Прочитать(Значение)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Значение);
	
	Результат = ПрочитатьJSON(ЧтениеJSON, Истина);
	
	Возврат Результат;
	
КонецФункции  

&НаСервереБезКонтекста
// Функция - Клиент GET
//
// Параметры:
//  Запрос	 - 	 - 
//  Хост	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Клиент_GET(Запрос, Хост)
	
	Возврат ВыполнитьHTTPМетод("GET", Запрос, Хост);
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Выполнить HTTPМетод
//
// Параметры:
//  Метод	 - 	 - 
//  Запрос	 - 	 - 
//  Хост	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВыполнитьHTTPМетод(Метод, Запрос, Хост)
	
	Возврат Соединение(Хост).ВызватьHTTPМетод(Метод, Запрос);
	
КонецФункции

&НаСервереБезКонтекста
// Функция - Соединение
//
// Параметры:
//  Хост - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция Соединение(Хост)
	
	Порт = 443;
	
	Соединение = Новый HTTPСоединение(Хост, Порт,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Возврат Соединение;
	
КонецФункции

&НаСервереБезКонтекста
// Функция - URL кодировать
//
// Параметры:
//  Параметр - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция URL_Кодировать(Параметр)
	
	Если ТипЗнч(Параметр) = Тип("Строка") Тогда
		
		Возврат КодироватьСтроку(Параметр, СпособКодированияСтроки.КодировкаURL);	
		
	ИначеЕсли ТипЗнч(Параметр) = Тип("Структура")
		ИЛИ ТипЗнч(Параметр) = Тип("Соответствие") Тогда
		
		МассивПараметров = Новый Массив;	
		
		Для Каждого Элемент Из Параметр Цикл
			
			Если Элемент.Значение = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Параметр = СтрШаблон("%1=%2", Элемент.Ключ, XMLСтрока(Элемент.Значение));
			МассивПараметров.Добавить(Параметр);
			
		КонецЦикла;
		
		Строка = СтрСоединить(МассивПараметров, "&");
		
		Возврат КодироватьСтроку(Строка, СпособКодированияСтроки.URLВКодировкеURL);
		
	КонецЕсли;
	
КонецФункции  

&НаКлиенте
// Процедура - Установить статус
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура УстановитьСтатус(Команда)
	
	Если (НЕ ЗначениеЗаполнено(Запись.checkingStatus)) ИЛИ (НЕ ((Запись.checkingStatus="Ok") ИЛИ (Запись.checkingStatus="Fail"))) Тогда
		ВызватьИсключение "Выберите статус Ok или Fail";
	КонецЕсли;
	
	Результат = ПолучитьСтатусСообщения(Запись.messageId, Запись.checkingStatus, Запись.description);  
	
	Если Результат Тогда
		
		ЭтаФорма.Записать();
 		ЭтаФорма.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтатусСообщения(messageId, checkingStatus, description)
	
	Возврат РегистрыСведений.СообщенияКонтурСтрахование.SetMessageStatus(messageId, checkingStatus, description);
	
КонецФункции 

#КонецОбласти
